# SetGroupTypeId Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
InternalDefinition..::..SetGroupTypeId Method
InternalDefinition Class See Also
---
Sets the built-in parameter group to which the parameter defined by this definition belongs.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void SetGroupTypeId(
	ForgeTypeId groupTypeId
)
```

Visual Basic
---
```text
Public Sub SetGroupTypeId ( _
	groupTypeId As ForgeTypeId _
)
```

Visual C++
---
```text
public:
void SetGroupTypeId(
	ForgeTypeId^ groupTypeId
)
```

# ### Parameters
groupTypeId
    Type: Autodesk.Revit.DB..::..ForgeTypeIdIdentifier of the built-in parameter group.
# Remarks
The parameter group can be changed, but only for parameters that are not built in. In other words: This method is only valid for parameter definitions for which GetParameterTypeId() returns a null identifier.
# See Also
InternalDefinition Class
Autodesk.Revit.DB Namespace